content-org/blog.org
#+TITLE: EmacsCast Episodes
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: blog
#+SEQ_TODO: TODO DONE
#+PROPERTY: header-args :eval never-export
#+OPTIONS: creator:t toc:nil

** DONE Episode 3: Org mode
CLOSED: [2018-08-10 Fri 20:19]
:PROPERTIES:
:EXPORT_FILE_NAME: episode_3
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :file_id "754222a0-714c-41b6-9203-8d0dc0d6210f", :youtube_id "3hHmHYPNyyE", :reddit_url "https://www.reddit.com/r/emacs/comments/966nag/emacscast_3_org_mode_and_a_bit_about_helm/"
:END:

Fresh "Config News" and an overview of Org mode, a powerful Emacs package for keeping notes, maintaining TODO lists, planning projects, and authoring documents with a fast and effective plain-text system.

*** Shownotes

- [[https://github.com/freetonik/emacs-dotfiles][My current config]]
- [[https://orgmode.org/][Org-mode]]
- [[https://workflowy.com/][Workflowy, a simple outliner]]
- [[http://cestlaz.github.io/posts/using-emacs-23-capture-1/][Org capture video tutorial]] by Mike Zamansky. [[http://cestlaz.github.io/posts/using-emacs-24-capture-2/#.WERjG3eZOuU][Part 2]].
- [[https://orgmode.org/worg/org-tutorials/orgtutorial_dto.html][David O'Toole Org tutorial]]
- [[https://www.youtube.com/watch?v=SzA2YODtgK4][Getting Started With Org Mode (YouTube)]] by Harry Schwartz.
- [[https://www.youtube.com/watch?v=sQS06Qjnkcc&list=PLVtKhBrRV_ZkPnBtt_TD1Cs9PJlU0IIdE][Getting yourself organized with OrgMode (YouTube playlist)]] by Rainer König

*** Plans for the next episode

- Reviewing feedback
- Config news :-)
- Vanilla Emacs vs. Evil Mode vs. Spacemacs vs. Doom

