content/blog/episode_3.md
+++
title = "Episode 3: Org mode"
author = ["Rakhim Davletkaliyev"]
date = 2018-08-10T20:19:00+03:00
draft = false
creator = "Emacs 26.3 (Org mode 9.3.6 + ox-hugo)"
file_id = "754222a0-714c-41b6-9203-8d0dc0d6210f"
youtube_id = "3hHmHYPNyyE"
reddit_url = "https://www.reddit.com/r/emacs/comments/966nag/emacscast_3_org_mode_and_a_bit_about_helm/"
+++

Fresh "Config News" and an overview of Org mode, a powerful Emacs package for keeping notes, maintaining TODO lists, planning projects, and authoring documents with a fast and effective plain-text system.


## Shownotes {#shownotes}

-   [My current config](https://github.com/freetonik/emacs-dotfiles)
-   [Org-mode](https://orgmode.org/)
-   [Workflowy, a simple outliner](https://workflowy.com/)
-   [Org capture video tutorial](http://cestlaz.github.io/posts/using-emacs-23-capture-1/) by Mike Zamansky. [Part 2](http://cestlaz.github.io/posts/using-emacs-24-capture-2/#.WERjG3eZOuU).
-   [David O'Toole Org tutorial](https://orgmode.org/worg/org-tutorials/orgtutorial%5Fdto.html)
-   [Getting Started With Org Mode (YouTube)](https://www.youtube.com/watch?v=SzA2YODtgK4) by Harry Schwartz.
-   [Getting yourself organized with OrgMode (YouTube playlist)](https://www.youtube.com/watch?v=sQS06Qjnkcc&list=PLVtKhBrRV%5FZkPnBtt%5FTD1Cs9PJlU0IIdE) by Rainer König


## Plans for the next episode {#plans-for-the-next-episode}

-   Reviewing feedback
-   Config news :-)
-   Vanilla Emacs vs. Evil Mode vs. Spacemacs vs. Doom
